app/views/songs/show.html.erb

<ul>
  <% @artist.songs.each do |song| %>
---
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]